# Aggregation & Groupby

The ``groupby`` method allows you to group rows of data together and call aggregate functions

### Basic aggregation methods:

* ``count()``   Compute count of group
* ``mean()``    Compute mean of groups
* ``median()``  Compute median of groups
* ``min()``     Compute min of group values
* ``max()``     Compute max of group values
* ``std()``     Standard deviation of groups
* ``var()``     Compute variance of groups
* ``sum()``     Compute sum of group values
* ``describe()``Generates descriptive statistics

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
df = sns.load_dataset("planets")

In [3]:
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [5]:
df.head(2)

            method  number  orbital_period  mass  distance  year
0  Radial Velocity       1         269.300  7.10     77.40  2006
1  Radial Velocity       1         874.774  2.21     56.95  2008

In [6]:
df.shape

(1035, 6)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [8]:
df['mass']

0        7.10
1        2.21
2        2.60
3       19.40
4       10.50
        ...
1030      NaN
1031      NaN
1032      NaN
1033      NaN
1034      NaN
Name: mass, Length: 1035, dtype: float64

In [9]:
df["mass"].mean()

2.6381605847953216

In [10]:
df["mass"].count()

513

In [11]:
df["mass"].min()

0.0036

In [12]:
df["mass"].max()

25.0

In [13]:
df["mass"].sum()

1353.37638

In [14]:
df["mass"].std()

3.8186166509616046

In [15]:
df["mass"].var()

14.58183312700122

In [16]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [18]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [17]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

 - # ``df.groupby()``

In [19]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [21]:
df['method'].unique()

array(['Radial Velocity', 'Imaging', 'Eclipse Timing Variations',
       'Transit', 'Astrometry', 'Transit Timing Variations',
       'Orbital Brightness Modulation', 'Microlensing', 'Pulsar Timing',
       'Pulsation Timing Variations'], dtype=object)

In [22]:
df['method'].nunique()

10

In [26]:
df['mass'].value_counts(dropna = False)

NaN       522
1.800       6
1.900       6
2.600       5
2.300       5
         ...
0.624       1
6.210       1
1.894       1
1.981       1
10.500      1
Name: mass, Length: 382, dtype: int64

In [24]:
df["method"].value_counts()

Radial Velocity                  553
Transit                          397
Imaging                           38
Microlensing                      23
Eclipse Timing Variations          9
Pulsar Timing                      5
Transit Timing Variations          4
Orbital Brightness Modulation      3
Astrometry                         2
Pulsation Timing Variations        1
Name: method, dtype: int64

In [27]:
df.groupby("method")

In [28]:
df.groupby("method").max()

                               number  orbital_period   mass  distance  year
method
Astrometry                          1     1016.000000    NaN     20.77  2013
Eclipse Timing Variations           2    10220.000000   6.05    500.00  2012
Imaging                             4   730000.000000    NaN    165.00  2013
Microlensing                        2     5100.000000    NaN   7720.00  2013
Orbital Brightness Modulation       2        1.544929    NaN   1180.00  2013
Pulsar Timing                       3    36525.000000    NaN   1200.00  2011
Pulsation Timing Variations         1     1170.000000    NaN       NaN  2007
Radial Velocity                     6    17337.500000  25.00    354.00  2014
Transit                             7      331.600590   1.47   8500.00  2014
Transit Timing Variations           3      160.000000    NaN   2119.00  2014

In [29]:
df.groupby("method").mean()

,number,orbital_period,mass,distance,year
method,,,,,
Astrometry,1.000000,631.180000,NaN,17.875000,2011.500000
Eclipse Timing Variations,1.666667,4751.644444,5.125000,315.360000,2010.000000
Imaging,1.315789,118247.737500,NaN,67.715937,2009.131579
Microlensing,1.173913,3153.571429,NaN,4144.000000,2009.782609
Orbital Brightness Modulation,1.666667,0.709307,NaN,1180.000000,2011.666667
Pulsar Timing,2.200000,7343.021201,NaN,1200.000000,1998.400000
Pulsation Timing Variations,1.000000,1170.000000,NaN,NaN,2007.000000
Radial Velocity,1.721519,823.354680,2.630699,51.600208,2007.518987
Transit,1.954660,21.102073,1.470000,599.298080,2011.236776
Transit Timing Variations,2.250000,79.783500,NaN,1104.333333,2012.500000

In [30]:
df.groupby("method").mean()['distance']

method
Astrometry                         17.875000
Eclipse Timing Variations         315.360000
Imaging                            67.715937
Microlensing                     4144.000000
Orbital Brightness Modulation    1180.000000
Pulsar Timing                    1200.000000
Pulsation Timing Variations              NaN
Radial Velocity                    51.600208
Transit                           599.298080
Transit Timing Variations        1104.333333
Name: distance, dtype: float64

In [31]:
df.groupby("method").mean()[['distance']]

                                  distance
method
Astrometry                       17.875000
Eclipse Timing Variations       315.360000
Imaging                          67.715937
Microlensing                   4144.000000
Orbital Brightness Modulation  1180.000000
Pulsar Timing                  1200.000000
Pulsation Timing Variations            NaN
Radial Velocity                  51.600208
Transit                         599.298080
Transit Timing Variations      1104.333333

In [33]:
df.groupby("method").describe()['year']

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,2011.500000,2.121320,2010.0,2010.75,2011.5,2012.25,2013.0
Eclipse Timing Variations,9.0,2010.000000,1.414214,2008.0,2009.00,2010.0,2011.00,2012.0
Imaging,38.0,2009.131579,2.781901,2004.0,2008.00,2009.0,2011.00,2013.0
Microlensing,23.0,2009.782609,2.859697,2004.0,2008.00,2010.0,2012.00,2013.0
Orbital Brightness Modulation,3.0,2011.666667,1.154701,2011.0,2011.00,2011.0,2012.00,2013.0
Pulsar Timing,5.0,1998.400000,8.384510,1992.0,1992.00,1994.0,2003.00,2011.0
Pulsation Timing Variations,1.0,2007.000000,NaN,2007.0,2007.00,2007.0,2007.00,2007.0
Radial Velocity,553.0,2007.518987,4.249052,1989.0,2005.00,2009.0,2011.00,2014.0
Transit,397.0,2011.236776,2.077867,2002.0,2010.00,2012.0,2013.00,2014.0
Transit Timing Variations,4.0,2012.500000,1.290994,2011.0,2011.75,2012.5,2013.25,2014.0

In [34]:
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [35]:
df.groupby('year')['distance'].sum()

year
1989       40.57
1992        0.00
1994        0.00
1995       15.36
1996       95.20
1997       17.43
1998      131.51
1999      464.21
2000      492.04
2001      438.38
2002     1376.28
2003     1034.05
2004     4249.89
2005     1719.92
2006    18486.41
2007     7319.52
2008     6315.54
2009     6810.71
2010    23882.06
2011    49447.33
2012    51259.04
2013    37613.51
2014     2159.02
Name: distance, dtype: float64

In [36]:
data = {'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
       'Person':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Sales':[200, 120, 340, 124, 243, 350]}

In [37]:
df1 = pd.DataFrame(data)

In [38]:
df1

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [39]:
df1.groupby('Company')[['Sales']].mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [40]:
df1.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [41]:
df1.groupby('Company').sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

 - # ``DataFrame`` Operations

- ### Common Operations ðŸ‘ˆ

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show **Common Operations** here in this lecture:

- Quick review and refresh

In [42]:
df2 = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df2.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Info on Unique Values

In [43]:
df2["col2"].unique()

array([444, 555, 666])

In [44]:
df2["col2"].nunique()

3

In [45]:
df2["col2"].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [46]:
df['mass'].value_counts(dropna = False)

NaN       522
1.800       6
1.900       6
2.600       5
2.300       5
         ...
0.624       1
6.210       1
1.894       1
1.981       1
10.500      1
Name: mass, Length: 382, dtype: int64

### Selecting Data

In [47]:
df2

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [48]:
df2['col1'] > 2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [49]:
df2[df2['col1'] > 2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [50]:
df2[(df2['col1'] > 2) & (df2['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

In [51]:
df2[(df2['col1']>2) | (df2['col2']==444)]

   col1  col2 col3
0     1   444  abc
2     3   666  ghi
3     4   444  xyz

**Get column and index names:**

In [52]:
df2

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [53]:
df2.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [54]:
df.columns

Index(['method', 'number', 'orbital_period', 'mass', 'distance', 'year'], dtype='object')

In [55]:
df2.shape

(4, 3)

In [56]:
df2.index

RangeIndex(start=0, stop=4, step=1)

In [58]:
df4 = df.groupby("method")["distance"].describe()

In [59]:
df4

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,17.875000,4.094148,14.98,16.4275,17.875,19.3225,20.77
Eclipse Timing Variations,4.0,315.360000,213.203907,130.72,130.7200,315.360,500.0000,500.00
Imaging,32.0,67.715937,53.736817,7.69,22.1450,40.395,132.6975,165.00
Microlensing,10.0,4144.000000,2076.611556,1760.00,2627.5000,3840.000,4747.5000,7720.00
Orbital Brightness Modulation,2.0,1180.000000,0.000000,1180.00,1180.0000,1180.000,1180.0000,1180.00
Pulsar Timing,1.0,1200.000000,NaN,1200.00,1200.0000,1200.000,1200.0000,1200.00
Pulsation Timing Variations,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Radial Velocity,530.0,51.600208,45.559381,1.35,24.4125,40.445,59.2175,354.00
Transit,224.0,599.298080,913.876990,38.00,200.0000,341.000,650.0000,8500.00
Transit Timing Variations,3.0,1104.333333,915.819487,339.00,597.0000,855.000,1487.0000,2119.00

In [60]:
df4.index

Index(['Astrometry', 'Eclipse Timing Variations', 'Imaging', 'Microlensing',
       'Orbital Brightness Modulation', 'Pulsar Timing',
       'Pulsation Timing Variations', 'Radial Velocity', 'Transit',
       'Transit Timing Variations'],
      dtype='object', name='method')

**Sorting and Ordering a DataFrame:**

In [61]:
df2

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [62]:
df2.sort_values(by = 'col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [63]:
df2.sort_values(by = 'col2', ascending = False, inplace = True)

In [64]:
df2

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz

- ### `.transform()`
- ### `.apply()`

### ``.transform()``

In [65]:
df4 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,23,33,22,11,99],
                   'var2': [100,253,333,262,111,969]})
df4

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [66]:
df4["var1"]*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: var1, dtype: int64

In [67]:
df_numeric = df4.iloc[:, 1:3]

In [68]:
df_numeric

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969

In [69]:
df_numeric.transform(lambda x : (x-x.mean()) / x.std())

       var1      var2
0 -0.687871 -0.738461
1 -0.299074 -0.263736
2  0.000000 -0.015514
3 -0.328982 -0.235811
4 -0.657963 -0.704331
5  1.973890  1.957853

In [70]:
df_numeric.iloc[0,0]

10

In [71]:
(df_numeric.iloc[0,0] - df_numeric['var1'].mean()) / df_numeric['var1'].std()

-0.6878708952377661

In [72]:
df_numeric.transform(lambda x : np.log10(x))

       var1      var2
0  1.000000  2.000000
1  1.361728  2.403121
2  1.518514  2.522444
3  1.342423  2.418301
4  1.041393  2.045323
5  1.995635  2.986324

In [73]:
df_numeric.transform(np.log10)

       var1      var2
0  1.000000  2.000000
1  1.361728  2.403121
2  1.518514  2.522444
3  1.342423  2.418301
4  1.041393  2.045323
5  1.995635  2.986324

### ``.apply()``

In [74]:
df4 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,23,33,22,11,99],
                   'var2': [100,253,333,262,111,969]})
df4

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [82]:
df4.apply('mean')

var1     33.0
var2    338.0
dtype: float64

In [76]:
df4['var1'].sum()

198

In [77]:
df4['groups'].sum()

'ABCABC'

In [84]:
df_numeric

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969

In [85]:
df_numeric.apply(np.median)

var1     22.5
var2    257.5
dtype: float64

In [ ]:
df_numeric

In [87]:
df_numeric.apply(np.mean, axis = 1)

0     55.0
1    138.0
2    183.0
3    142.0
4     61.0
5    534.0
dtype: float64

In [88]:
df4

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [89]:
df4.groupby("groups").apply(np.mean)

        var1   var2
groups
A       16.0  181.0
B       17.0  182.0
C       66.0  651.0

In [90]:
df4.groupby("groups").mean()

        var1  var2
groups
A         16   181
B         17   182
C         66   651

In [91]:
df2 = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abcc','de','ghi','xyzzz']})

df2

   col1  col2   col3
0     1   444   abcc
1     2   555     de
2     3   666    ghi
3     4   444  xyzzz

In [92]:
def times2(x):
    return x * 2

In [93]:
df2["col1"].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [94]:
df2["col3"].apply(len)

0    4
1    2
2    3
3    5
Name: col3, dtype: int64

### `df.transform() vs df.apply()`

In [95]:
df2

   col1  col2   col3
0     1   444   abcc
1     2   555     de
2     3   666    ghi
3     4   444  xyzzz

In [96]:
df2.transform(len)

ValueError: transforms cannot produce aggregated results

In [97]:
df2["col3"].transform(len)

0    4
1    2
2    3
3    5
Name: col3, dtype: int64

In [98]:
df2.apply(len)

col1    4
col2    4
col3    4
dtype: int64

In [99]:
df1 = pd.DataFrame([["a", 9, 25]] * 4, columns=["grp", 'P', 'Q'])
df2 = pd.DataFrame([["b", 9, 25]] * 3, columns=["grp", 'P', 'Q'])
df3 = pd.concat([df1, df2], ignore_index=True)
df3

  grp  P   Q
0   a  9  25
1   a  9  25
2   a  9  25
3   a  9  25
4   b  9  25
5   b  9  25
6   b  9  25

In [100]:
df3.apply(lambda x : x + x)

  grp   P   Q
0  aa  18  50
1  aa  18  50
2  aa  18  50
3  aa  18  50
4  bb  18  50
5  bb  18  50
6  bb  18  50

In [101]:
df3.transform(lambda y : y + y)

  grp   P   Q
0  aa  18  50
1  aa  18  50
2  aa  18  50
3  aa  18  50
4  bb  18  50
5  bb  18  50
6  bb  18  50

In [102]:
df3

  grp  P   Q
0   a  9  25
1   a  9  25
2   a  9  25
3   a  9  25
4   b  9  25
5   b  9  25
6   b  9  25

In [103]:
df3.groupby("grp").apply(sum)

      grp   P    Q
grp
a    aaaa  36  100
b     bbb  27   75

In [106]:
df3.groupby("grp").transform(np.mean)

   P   Q
0  9  25
1  9  25
2  9  25
3  9  25
4  9  25
5  9  25
6  9  25

In [107]:
df3.groupby("grp").sum()

      P    Q
grp
a    36  100
b    27   75

In [108]:
df3

  grp  P   Q
0   a  9  25
1   a  9  25
2   a  9  25
3   a  9  25
4   b  9  25
5   b  9  25
6   b  9  25

In [109]:
df3.groupby("grp").transform(len)

   P  Q
0  4  4
1  4  4
2  4  4
3  4  4
4  3  3
5  3  3
6  3  3

In [110]:
df3.iloc[0:4]

  grp  P   Q
0   a  9  25
1   a  9  25
2   a  9  25
3   a  9  25

In [111]:
len(df3.iloc[0:4])

4

In [112]:
df3.groupby("grp").apply(len)

grp
a    4
b    3
dtype: int64

### Pivot Tables

In [113]:
titanic = sns.load_dataset("titanic")

In [114]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [115]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [116]:
titanic.groupby(["sex", "class"])[["survived"]].mean()

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [117]:
titanic.groupby(["sex", "class"])[["survived"]].mean().T

sex         female                      male
class        First    Second Third     First    Second     Third
survived  0.968085  0.921053   0.5  0.368852  0.157407  0.135447

In [118]:
titanic.groupby(["sex", "class"])[["survived"]].mean().unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

### Using pivot table

- Create a spreadsheet-style pivot table as a ``DataFrame``.

In [120]:
titanic.pivot_table(values = "survived", index = "sex", columns = "class", aggfunc = 'sum')

class   First  Second  Third
sex
female     91      70     72
male       45      17     47

In [ ]:
titanic.head(2)

In [ ]:
titanic.pivot_table("age", index = "sex", columns = "class")

In [ ]:
titanic.pivot_table("age", index = "class", columns = "sex")

In [121]:
data = {'A':['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
       'B':['one', 'one', 'two', 'two', 'one', 'one'],
       'C':['x', 'y', 'x', 'y', 'x', 'y'],
       'D':[1, 3, 2, 5, 4, 1]}

df5 = pd.DataFrame(data)

df5

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [122]:
df5.pivot_table(values = "D", index = ["A", "B"], columns = "C")

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# The End of the Session